[Killed] ArrayItemRemoval
Commands/FlightLinksCommand.php:69:13
 
         $daysOfWeekToExclude = $this->choice(
             'Which days would you like to exclude?',
-            ['None', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
+            $daysOfWeekToExclude = $this->choice('Which days would you like to exclude?', ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'], multiple: true);
             multiple: true,
         );
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] TrueValue
Commands/FlightLinksCommand.php:70:13
         $daysOfWeekToExclude = $this->choice(
             'Which days would you like to exclude?',
             ['None', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
-            multiple: true,
+            $daysOfWeekToExclude = $this->choice('Which days would you like to exclude?', ['None', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'], multiple: false);
         );
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] MethodCallRemoval
Commands/FlightLinksCommand.php:75:9
 
         $departurePeriodBuilder = $departurePeriodBuilder->withoutDays(...$daysOfWeekToExclude);
 
-        $this->table(['Date', 'Day'], Collection::make($departurePeriodBuilder->get())->map(fn(Carbon $date) => [
-            $date->format('Y-m-d'),
-            $date->englishDayOfWeek,
-        ])->toArray());
+        
 
         $isRoundTrip = $this->confirm('Is this a round trip?', true);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] TrueValue
Commands/FlightLinksCommand.php:80:9
             $date->englishDayOfWeek,
         ])->toArray());
 
-        $isRoundTrip = $this->confirm('Is this a round trip?', true);
+        $isRoundTrip = $this->confirm('Is this a round trip?', false);
 
         if ($isRoundTrip === true) {
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] TrueValue
Commands/FlightLinksCommand.php:82:9
 
         $isRoundTrip = $this->confirm('Is this a round trip?', true);
 
-        if ($isRoundTrip === true) {
+        if ($isRoundTrip === false) {
             $returnRangeA = $dateQuestionnaire->validDate('Return date (beginning of range)');
             $returnRangeB = $dateQuestionnaire->validDate('Return date (end of range)');
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
ErrorException: Undefined variable $dates

/Users/ag/Documents/Projects/link-generator/vendor/laravel-zero/foundation/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:259
/Users/ag/Documents/Projects/link-generator/app/Commands/FlightLinksCommand.php:83
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/Bou

[Killed] Identical
Commands/FlightLinksCommand.php:82:9
 
         $isRoundTrip = $this->confirm('Is this a round trip?', true);
 
-        if ($isRoundTrip === true) {
+        if ($isRoundTrip !== true) {
             $returnRangeA = $dateQuestionnaire->validDate('Return date (beginning of range)');
             $returnRangeB = $dateQuestionnaire->validDate('Return date (end of range)');
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
ErrorException: Undefined variable $dates

/Users/ag/Documents/Projects/link-generator/vendor/laravel-zero/foundation/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:259
/Users/ag/Documents/Projects/link-generator/app/Commands/FlightLinksCommand.php:83
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/Bou

[Killed] TrueValue
Commands/FlightLinksCommand.php:91:17
             $daysOfWeekToExclude = $this->choice(
                 'Which days would you like to exclude?',
                 ['None', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
-                multiple: true
+                $daysOfWeekToExclude = $this->choice('Which days would you like to exclude?', ['None', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'], multiple: false);
             );
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] MethodCallRemoval
Commands/FlightLinksCommand.php:96:13
 
             $returnPeriodBuilder = $returnPeriodBuilder->withoutDays(...$daysOfWeekToExclude);
 
-            $this->table(['Date', 'Day'], Collection::make($returnPeriodBuilder->get())->map(fn(Carbon $date) => [
-                $date->format('Y-m-d'),
-                $date->englishDayOfWeek,
-            ])->toArray());
+            
 
             $minimumStay = $dateQuestionnaire->validInterval('What is your minimum stay?');
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ArrayItemRemoval
Commands/FlightLinksCommand.php:96:13
 
             $returnPeriodBuilder = $returnPeriodBuilder->withoutDays(...$daysOfWeekToExclude);
 
-            $this->table(['Date', 'Day'], Collection::make($returnPeriodBuilder->get())->map(fn(Carbon $date) => [
+            $this->table(['Day'], Collection::make($returnPeriodBuilder->get())->map(fn(Carbon $date) => [$date->format('Y-m-d'), $date->englishDayOfWeek])->toArray());
                 $date->format('Y-m-d'),
                 $date->englishDayOfWeek,
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] DecrementInteger
Commands/FlightLinksCommand.php:111:17
                         ->reject(fn(Carbon $return) => $return->greaterThan($departure->copy()->add($maximumStay)))
                         ->map(fn(Carbon $return) => new DatePair(new CarbonImmutable($departure), new CarbonImmutable($return)));
                 })
-                ->flatten(1);
+                })->flatten(0);
         }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] IncrementInteger
Commands/FlightLinksCommand.php:111:17
                         ->reject(fn(Carbon $return) => $return->greaterThan($departure->copy()->add($maximumStay)))
                         ->map(fn(Carbon $return) => new DatePair(new CarbonImmutable($departure), new CarbonImmutable($return)));
                 })
-                ->flatten(1);
+                })->flatten(2);
         }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] FalseValue
Commands/FlightLinksCommand.php:114:9
                 ->flatten(1);
         }
 
-        if ($isRoundTrip === false) {
+        if ($isRoundTrip === true) {
             $dates = Collection::make($departurePeriodBuilder->get())
                 ->map(fn(Carbon $departure) => new CarbonImmutable($departure));
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Identical
Commands/FlightLinksCommand.php:114:9
                 ->flatten(1);
         }
 
-        if ($isRoundTrip === false) {
+        if ($isRoundTrip !== false) {
             $dates = Collection::make($departurePeriodBuilder->get())
                 ->map(fn(Carbon $departure) => new CarbonImmutable($departure));
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] DecrementInteger
Commands/FlightLinksCommand.php:124:9
 
         $flightEngineData = ($flightEngineQuestionnaire)($this);
 
-        $counter = 0;
+        $counter = -1;
 
         $default = __DIR__ . '/flights.txt';
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] ConcatOperandRemoval
Commands/FlightLinksCommand.php:126:9
 
         $counter = 0;
 
-        $default = __DIR__ . '/flights.txt';
+        $default = __DIR__;
         $path = $this->ask("Provide a fully qualified path to a file you'd like to save the links to", $default);
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ConcatOperandRemoval
Commands/FlightLinksCommand.php:126:9
 
         $counter = 0;
 
-        $default = __DIR__ . '/flights.txt';
+        $default = '/flights.txt';
         $path = $this->ask("Provide a fully qualified path to a file you'd like to save the links to", $default);
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] LogicalAnd
Commands/FlightLinksCommand.php:129:9
         $default = __DIR__ . '/flights.txt';
         $path = $this->ask("Provide a fully qualified path to a file you'd like to save the links to", $default);
 
-        File::exists($path) && File::delete($path);
+        File::exists($path) || File::delete($path);
         File::put($path, '');
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] MethodCallRemoval
Commands/FlightLinksCommand.php:130:9
         $path = $this->ask("Provide a fully qualified path to a file you'd like to save the links to", $default);
 
         File::exists($path) && File::delete($path);
-        File::put($path, '');
+        
 
         foreach ($flightEngineData->markets() as $market) {
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Foreach_
Commands/FlightLinksCommand.php:132:9
         File::exists($path) && File::delete($path);
         File::put($path, '');
 
-        foreach ($flightEngineData->markets() as $market) {
-            foreach ($dates as $date) {
-                foreach ($flightEngineData->origins() as $origin) {
-                    foreach ($flightEngineData->destinations() as $destination) {
-                        $flightWrapper = new FlightWrapper(
-                            $flightEngineData,
-                            $date,
-                            $market,
-                            $origin,
-                            $destination,
-                            new Uri()
-                        );
-
-                        $flightWrapper = $pipeline->send($flightWrapper)
-                            ->through($flightEngine->pipes())
-                            ->thenReturn();
-
-                        $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
-                        $counter++;
-                    }
-                }
-            }
-        }
+        foreach (array() as $market) {
 
         $this->info("Generated {$counter} links");
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] Foreach_
Commands/FlightLinksCommand.php:133:13
         File::put($path, '');
 
         foreach ($flightEngineData->markets() as $market) {
-            foreach ($dates as $date) {
-                foreach ($flightEngineData->origins() as $origin) {
-                    foreach ($flightEngineData->destinations() as $destination) {
-                        $flightWrapper = new FlightWrapper(
-                            $flightEngineData,
-                            $date,
-                            $market,
-                            $origin,
-                            $destination,
-                            new Uri()
-                        );
-
-                        $flightWrapper = $pipeline->send($flightWrapper)
-                            ->through($flightEngine->pipes())
-                            ->thenReturn();
-
-                        $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
-                        $counter++;
-                    }
-                }
-            }
+            foreach (array() as $date) {
         }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] Foreach_
Commands/FlightLinksCommand.php:134:17
 
         foreach ($flightEngineData->markets() as $market) {
             foreach ($dates as $date) {
-                foreach ($flightEngineData->origins() as $origin) {
-                    foreach ($flightEngineData->destinations() as $destination) {
-                        $flightWrapper = new FlightWrapper(
-                            $flightEngineData,
-                            $date,
-                            $market,
-                            $origin,
-                            $destination,
-                            new Uri()
-                        );
-
-                        $flightWrapper = $pipeline->send($flightWrapper)
-                            ->through($flightEngine->pipes())
-                            ->thenReturn();
-
-                        $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
-                        $counter++;
-                    }
-                }
+                foreach (array() as $origin) {
             }
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] Foreach_
Commands/FlightLinksCommand.php:135:21
         foreach ($flightEngineData->markets() as $market) {
             foreach ($dates as $date) {
                 foreach ($flightEngineData->origins() as $origin) {
-                    foreach ($flightEngineData->destinations() as $destination) {
-                        $flightWrapper = new FlightWrapper(
-                            $flightEngineData,
-                            $date,
-                            $market,
-                            $origin,
-                            $destination,
-                            new Uri()
-                        );
-
-                        $flightWrapper = $pipeline->send($flightWrapper)
-                            ->through($flightEngine->pipes())
-                            ->thenReturn();
-
-                        $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
-                        $counter++;
-                    }
+                    foreach (array() as $destination) {
                 }
             }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] MethodCallRemoval
Commands/FlightLinksCommand.php:149:25
                             ->through($flightEngine->pipes())
                             ->thenReturn();
 
-                        $this->info((string) $flightWrapper->carry);
+                        
                         File::append($path, (string) $flightWrapper->carry . PHP_EOL);
                         $counter++;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "fra/lax".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/Documents/Pr

[Killed] ConcatOperandRemoval
Commands/FlightLinksCommand.php:150:25
                             ->thenReturn();
 
                         $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
+                        File::append($path, (string) $flightWrapper->carry);
                         $counter++;
                     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 1 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ConcatOperandRemoval
Commands/FlightLinksCommand.php:150:25
                             ->thenReturn();
 
                         $this->info((string) $flightWrapper->carry);
-                        File::append($path, (string) $flightWrapper->carry . PHP_EOL);
+                        File::append($path, PHP_EOL);
                         $counter++;
                     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Increment
Commands/FlightLinksCommand.php:151:25
 
                         $this->info((string) $flightWrapper->carry);
                         File::append($path, (string) $flightWrapper->carry . PHP_EOL);
-                        $counter++;
+                        $counter--;
                     }
                 }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] MethodCallRemoval
Commands/FlightLinksCommand.php:157:9
             }
         }
 
-        $this->info("Generated {$counter} links");
+        
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D
