[NoCoverage] FunctionCallRemoval
Commands/InspireCommand.php:32:9
      */
     public function handle()
     {
-        render(<<<'HTML'
-            <div class="py-1 ml-2">
-                <div class="px-1 bg-blue-300 text-black">Laravel Zero</div>
-                <em class="ml-1">
-                  Simplicity is the ultimate sophistication.
-                </em>
-            </div>
-        HTML);
+        
     }
 
