[NoCoverage] MethodCallRemoval
Commands/Questionnaires/DateQuestionnaire.php:24:13
         try {
             $date = CarbonImmutable::parse($answer);
         } catch (InvalidFormatException) {
-            $this->command->error('Invalid date format. Please try again.');
+            
             return $this->validDate($query);
         }

[Killed] While_
Commands/Questionnaires/DateQuestionnaire.php:28:9
             return $this->validDate($query);
         }
 
-        while (!$date->isValid()) {
-            $this->command->error('Invalid date');
-            $this->validDate($query);
-        }
+        while (false) {
 
         return $date;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Timeout] LogicalNot
Commands/Questionnaires/DateQuestionnaire.php:28:9
             return $this->validDate($query);
         }
 
-        while (!$date->isValid()) {
+        while ($date->isValid()) {
             $this->command->error('Invalid date');
             $this->validDate($query);

[NoCoverage] MethodCallRemoval
Commands/Questionnaires/DateQuestionnaire.php:29:13
         }
 
         while (!$date->isValid()) {
-            $this->command->error('Invalid date');
+            
             $this->validDate($query);
         }

[NoCoverage] MethodCallRemoval
Commands/Questionnaires/DateQuestionnaire.php:30:13
 
         while (!$date->isValid()) {
             $this->command->error('Invalid date');
-            $this->validDate($query);
+            
         }
 

[NoCoverage] MethodCallRemoval
Commands/Questionnaires/DateQuestionnaire.php:43:13
         try {
             $interval = CarbonInterval::fromString($answer);
         } catch (InvalidintervalException) {
-            $this->command->error('Invalid interval format. Please try again.');
+            
             return $this->validInterval($query);
         }
