[Killed] FalseValue
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:25:9
         $originAirports = $this->getOriginAirports($command);
         $destinationAirports = $this->getDestinationAirports($command);
 
-        $wantsToIncludeAirlines = $command->confirm('Do you want to include specific airlines?', false);
+        $wantsToIncludeAirlines = $command->confirm('Do you want to include specific airlines?', true);
         $airlines = $wantsToIncludeAirlines ? $this->getAirlines($command) : null;
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Ternary
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:26:9
         $destinationAirports = $this->getDestinationAirports($command);
 
         $wantsToIncludeAirlines = $command->confirm('Do you want to include specific airlines?', false);
-        $airlines = $wantsToIncludeAirlines ? $this->getAirlines($command) : null;
+        $airlines = $wantsToIncludeAirlines ? null : $this->getAirlines($command);
 
         $adults = $this->getAdults($command);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Question "Which airlines? (e.g. -32456 = Cathay Pacific)" was not asked.

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:331
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/Pending

[Killed] FalseValue
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:34:9
 
         $maxStopovers = $this->getMaxStopovers($command);
         $maxDuration = (new DateQuestionnaire($command))->validInterval('Maximum duration of entire trip');
-        $alternatives = $command->confirm('Include alternative airports', false);
+        $alternatives = $command->confirm('Include alternative airports', true);
         $cabinClass = Cabin::from($command->choice(
             'Cabin class',
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastString
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:38:17
         $cabinClass = Cabin::from($command->choice(
             'Cabin class',
             Collection::make(Cabin::cases())
-                ->map(fn (Cabin $cabin) => (string) $cabin->value)
+                $cabinClass = Cabin::from($command->choice('Cabin class', Collection::make(Cabin::cases())->map(fn(Cabin $cabin) => $cabin->value)->toArray(), Cabin::Economy->value));
                 ->toArray(),
             Cabin::Economy->value,
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] FalseValue
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:51:9
         ));
 
         $marketLimit = $this->getMarketLimit($command);
-        $wantsCustomMarket = $command->confirm('Would you like to specify custom markets? (e.g. US, UK, DE)', false);
+        $wantsCustomMarket = $command->confirm('Would you like to specify custom markets? (e.g. US, UK, DE)', true);
         $customMarkets = $wantsCustomMarket ? $this->getCustomMarkets($command) : [];
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Ternary
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:52:9
 
         $marketLimit = $this->getMarketLimit($command);
         $wantsCustomMarket = $command->confirm('Would you like to specify custom markets? (e.g. US, UK, DE)', false);
-        $customMarkets = $wantsCustomMarket ? $this->getCustomMarkets($command) : [];
+        $customMarkets = $wantsCustomMarket ? [] : $this->getCustomMarkets($command);
 
         $allMarkets = Collection::make($market->iso2($marketLimit))
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Question "Which markets?" was not asked.

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:331
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/Docume

[Killed] Identical
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:78:9
 
     public function supports(FlightEngine $flightEngine): bool
     {
-        return $flightEngine === FlightEngine::SkyScanner;
+        return $flightEngine !== FlightEngine::SkyScanner;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/collections/Collection.php:1238
/Users/ag/Documents/Projects/link-generator/app/Commands/FlightLinksCommand.php:120
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/BoundMethod.php:36
/Users/ag/Documents/Proj

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:90:9
             ->map(fn(string $airport) => Str::of($airport)->trim()->lower()->value())
             ->filter(fn(string $airport) => strlen($airport) === 3);
 
-        while ($originAirports->isEmpty() === true) {
-            return $this->getOriginAirports($command);
-        }
+        while (false) {
 
         return $originAirports;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:106:9
             ->map(fn(string $airport) => Str::of($airport)->trim()->lower()->value())
             ->filter(fn(string $airport) => strlen($airport) === 3);
 
-        while ($destinationAirports->isEmpty() === true) {
-            return $this->getDestinationAirports($command);
-        }
+        while (false) {
 
         return $destinationAirports;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:122:9
             ->map(fn(string $airline) => Str::of($airline)->trim()->value())
             ->reject(fn(string $airline) => Str::of($airline)->startsWith('-') === false);
 
-        while ($airlines->isEmpty() === true) {
-            return $this->getAirlines($command);
-        }
+        while (false) {
 
         return $airlines;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:133:9
     {
         $adults = $command->ask('How many adults?', '1');
 
-        while (!is_numeric($adults)) {
-            return $this->getAdults($command);
-        }
+        while (false) {
 
         return (int) $adults;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastInt
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:137:9
             return $this->getAdults($command);
         }
 
-        return (int) $adults;
+        return $adults;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:144:9
     {
         $children = $command->ask('How many children?', '0');
 
-        while (!is_numeric($children)) {
-            return $this->getChildren($command);
-        }
+        while (false) {
 
         return (int) $children;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastInt
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:148:9
             return $this->getChildren($command);
         }
 
-        return (int) $children;
+        return $children;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:155:9
     {
         $infants = $command->ask('How many infants?', '0');
 
-        while (!is_numeric($infants)) {
-            return $this->getInfants($command);
-        }
+        while (false) {
 
         return (int) $infants;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastInt
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:159:9
             return $this->getInfants($command);
         }
 
-        return (int) $infants;
+        return $infants;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:166:9
     {
         $maxStopovers = $command->ask('Maximum stopovers', '0');
 
-        while (!is_numeric($maxStopovers)) {
-            return $this->getMaxStopovers($command);
-        }
+        while (false) {
 
         return (int) $maxStopovers;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastInt
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:170:9
             return $this->getMaxStopovers($command);
         }
 
-        return (int) $maxStopovers;
+        return $maxStopovers;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:182:9
             ->map(fn(string $market) => Str::of($market)->trim()->value())
             ->filter(fn(string $market) => strlen($market) === 2);
 
-        while ($customMarkets->isEmpty() === true) {
-            return $this->getCustomMarkets($command);
-        }
+        while (false) {
 
         return $customMarkets;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:193:9
     {
         $marketLimit = $command->ask('Market limit (higher = more links)', '5');
 
-        while (!is_numeric($marketLimit)) {
-            return $this->getMarketLimit($command);
-        }
+        while (false) {
 
         return (int) $marketLimit;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastInt
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:197:9
             return $this->getMarketLimit($command);
         }
 
-        return (int) $marketLimit;
+        return $marketLimit;
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] While_
Commands/Questionnaires/FlightEngines/SkyScannerQuestionnaire.php:204:9
     {
         $currency = Str::of($command->ask('Currency', 'USD'))->trim();
 
-        while ($currency->length() !== 3) {
-            return $this->getCurrency($command);
-        }
+        while (false) {
 
         return $currency->value();
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
