[Killed] MatchArmRemoval
Enums/Cabin.php:14:9
 
     public function skyScannerName(): string
     {
-        return match ($this) {
-            self::Economy => 'economy',
-            self::PremiumEconomy => 'premiumeconomy',
-            self::Business => 'business',
-            self::First => 'first',
-        };
+        
     }
 }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
UnhandledMatchError: Unhandled match case of type App\Enums\Cabin

/Users/ag/Documents/Projects/link-generator/app/Enums/Cabin.php:16
/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/CabinClass.php:22
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/pipeline/Pipeline.php:181
/Users/ag/Docu
