[NoCoverage] MatchArmRemoval
Enums/FlightEngine.php:27:9
 
     public function friendlyName(): string
     {
-        return match ($this) {
-            self::SkyScanner => 'SkyScanner',
-            self::Momondo => 'Momondo',
-        };
+        
     }
 

[Killed] MatchArmRemoval
Enums/FlightEngine.php:38:9
      */
     public function pipes(): array
     {
-        return match ($this) {
-            self::SkyScanner => [
-                ConfigureUriStructure::class,
-                Origin::class,
-                Destination::class,
-                DepartureDate::class,
-                ReturnDate::class,
-                Passengers::class,
-                Stopovers::class,
-                CabinClass::class,
-                Duration::class,
-                Airlines::class,
-                Alternatives::class,
-                Localization::class
-            ],
-            self::Momondo => []
-        };
+        
     }
 }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
UnhandledMatchError: Unhandled match case of type App\Enums\FlightEngine

/Users/ag/Documents/Projects/link-generator/app/Enums/FlightEngine.php:36
/Users/ag/Documents/Projects/link-generator/app/Commands/FlightLinksCommand.php:146
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/BoundMethod.php:36
/Users/ag/Docu
