[Killed] DecrementInteger
Enums/Market.php:19:5
     /**
      * @return Collection<int, string>
      */
-    public function iso2(int $limit = 10): Collection
+    public function iso2(int $limit = 9) : Collection
     {
         return match ($this) {
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] IncrementInteger
Enums/Market.php:19:5
     /**
      * @return Collection<int, string>
      */
-    public function iso2(int $limit = 10): Collection
+    public function iso2(int $limit = 11) : Collection
     {
         return match ($this) {
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] MatchArmRemoval
Enums/Market.php:21:9
      */
     public function iso2(int $limit = 10): Collection
     {
-        return match ($this) {
-            self::Random => $this->random($limit),
-            self::HighGDP => $this->highGDP($limit),
-            self::LowGDP => $this->lowGDP($limit),
-            self::Scandinavia => $this->scandinavia($limit),
-        };
+        
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[NoCoverage] UnwrapStrToLower
Enums/Market.php:39:13
         return Collection::make(iterator_to_array($codes))
             ->random($limit)
             ->map(fn(array $country) => $country['alpha2'])
-            ->map(fn(string $code) => strtolower($code))
+            return Collection::make(iterator_to_array($codes))->random($limit)->map(fn(array $country) => $country['alpha2'])->map(fn(string $code) => $code)->values();
             ->values();
     }
