[Killed] UnwrapStrToLower
PeriodBuilder.php:21:9
 
     public function withoutDays(string ...$days): self
     {
-        $days = array_map(fn(string $day) => strtolower($day), $days);
+        $days = array_map(fn(string $day) => $day, $days);
         $newPeriod = $this->period->filter(fn(Carbon $date) => !in_array(strtolower($date->dayName), $days));
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] UnwrapArrayMap
PeriodBuilder.php:21:9
 
     public function withoutDays(string ...$days): self
     {
-        $days = array_map(fn(string $day) => strtolower($day), $days);
+        $days = $days;
         $newPeriod = $this->period->filter(fn(Carbon $date) => !in_array(strtolower($date->dayName), $days));
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "Generated 32 links".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/D

[Killed] UnwrapStrToLower
PeriodBuilder.php:22:9
     public function withoutDays(string ...$days): self
     {
         $days = array_map(fn(string $day) => strtolower($day), $days);
-        $newPeriod = $this->period->filter(fn(Carbon $date) => !in_array(strtolower($date->dayName), $days));
+        $newPeriod = $this->period->filter(fn(Carbon $date) => !in_array($date->dayName, $days));
 
         return new self($newPeriod);
killedBy: Tests\Unit\PeriodBuilderTest::applying_a_day_exclusion_works with data set "Monday"
statusReason: 1) Tests\Unit\PeriodBuilderTest::applying_a_day_exclusion_works with data set "Monday" ('Monday')
Failed asserting that an array does not contain 'monday'.

/Users/ag/Documents/Projects/link-generator/tests/Unit/PeriodBuilderTest.php:28

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
PeriodBuilder.php:22:9
     public function withoutDays(string ...$days): self
     {
         $days = array_map(fn(string $day) => strtolower($day), $days);
-        $newPeriod = $this->period->filter(fn(Carbon $date) => !in_array(strtolower($date->dayName), $days));
+        $newPeriod = $this->period->filter(fn(Carbon $date) => in_array(strtolower($date->dayName), $days));
 
         return new self($newPeriod);
killedBy: Tests\Unit\PeriodBuilderTest::applying_a_day_exclusion_works with data set "Monday"
statusReason: 1) Tests\Unit\PeriodBuilderTest::applying_a_day_exclusion_works with data set "Monday" ('Monday')
Failed asserting that an array does not contain 'monday'.

/Users/ag/Documents/Projects/link-generator/tests/Unit/PeriodBuilderTest.php:28

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] UnwrapStrToLower
PeriodBuilder.php:30:9
     public function withDays(string ...$days): self
     {
         $days = array_map(fn(string $day) => strtolower($day), $days);
-        $newPeriod = $this->period->filter(fn(Carbon $date) => in_array(strtolower($date->dayName), $days));
+        $newPeriod = $this->period->filter(fn(Carbon $date) => in_array($date->dayName, $days));
 
         return new self($newPeriod);
killedBy: Tests\Unit\PeriodBuilderTest::with_days_works with data set "Monday"
statusReason: 1) Tests\Unit\PeriodBuilderTest::with_days_works with data set "Monday" ('Monday')
Failed asserting that an array contains 'monday'.

/Users/ag/Documents/Projects/link-generator/tests/Unit/PeriodBuilderTest.php:47

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
