[Killed] Identical
Pipelines/FlightEngines/SkyScanner/Airlines.php:22:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        if ($payload->flightEngineQuestionnaireData->includeAirlines === null) {
+        if ($payload->flightEngineQuestionnaireData->includeAirlines !== null) {
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ArrayItemRemoval
Pipelines/FlightEngines/SkyScanner/Airlines.php:26:9
             return $next($payload);
         }
 
-        $payload->carry = Uri::withQueryValues($payload->carry, [
-            'airlines' => $payload->flightEngineQuestionnaireData->includeAirlines->map(fn(string $airline) => Str::of($airline)
-                ->trim()
-            )->implode(',')
-        ]);
+        $payload->carry = Uri::withQueryValues($payload->carry, []);
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
