[Killed] FalseValue
Pipelines/FlightEngines/SkyScanner/Alternatives.php:21:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        if ($payload->flightEngineQuestionnaireData->alternatives === false) {
+        if ($payload->flightEngineQuestionnaireData->alternatives === true) {
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Identical
Pipelines/FlightEngines/SkyScanner/Alternatives.php:21:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        if ($payload->flightEngineQuestionnaireData->alternatives === false) {
+        if ($payload->flightEngineQuestionnaireData->alternatives !== false) {
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
