[Killed] InstanceOf_
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:21:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        if ($payload->dates instanceof CarbonImmutable) {
+        if (true) {
             $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->format('ymd'));
             return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Error: Call to undefined method App\ValueObjects\DatePair::format()

/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/DepartureDate.php:20
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/pipeline/Pipeline.php:181
/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyS

[Killed] InstanceOf_
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:21:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        if ($payload->dates instanceof CarbonImmutable) {
+        if (false) {
             $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->format('ymd'));
             return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:22:13
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
         if ($payload->dates instanceof CarbonImmutable) {
-            $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->format('ymd'));
+            $payload->carry = $payload->carry->withPath($payload->carry->getPath() . $payload->dates->format('ymd'));
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:22:13
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
         if ($payload->dates instanceof CarbonImmutable) {
-            $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->format('ymd'));
+            $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/');
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Concat
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:26:9
             return $next($payload);
         }
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->dateA->format('ymd'));
+        $payload->carry = $payload->carry->withPath('/' . $payload->carry->getPath() . $payload->dates->dateA->format('ymd'));
         return $next($payload);
     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/DepartureDate.php:26:9
             return $next($payload);
         }
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->dateA->format('ymd'));
+        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/');
         return $next($payload);
     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
