[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/Destination.php:21:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->destination);
+        $payload->carry = $payload->carry->withPath('/' . $payload->destination);
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "fra/lax".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/Documents/Pr

[Killed] Concat
Pipelines/FlightEngines/SkyScanner/Destination.php:21:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->destination);
+        $payload->carry = $payload->carry->withPath('/' . $payload->carry->getPath() . $payload->destination);
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "fra/lax".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/Documents/Pr
