[Killed] CastString
Pipelines/FlightEngines/SkyScanner/Duration.php:22:13
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
         $payload->carry = Uri::withQueryValues($payload->carry, [
-            'duration' => (string) $payload->flightEngineQuestionnaireData->maxDuration->totalMinutes
+            $payload->carry = Uri::withQueryValues($payload->carry, ['duration' => $payload->flightEngineQuestionnaireData->maxDuration->totalMinutes]);
         ]);
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
