[Killed] ArrayItemRemoval
Pipelines/FlightEngines/SkyScanner/Localization.php:21:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        $payload->carry = Uri::withQueryValues($payload->carry, [
-            'market' => $payload->market,
-            'currency' => $payload->flightEngineQuestionnaireData->currency,
-            'locale' => config('app.locale'),
-        ]);
+        $payload->carry = Uri::withQueryValues($payload->carry, ['currency' => $payload->flightEngineQuestionnaireData->currency, 'locale' => config('app.locale')]);
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] ArrayItem
Pipelines/FlightEngines/SkyScanner/Localization.php:24:13
         $payload->carry = Uri::withQueryValues($payload->carry, [
             'market' => $payload->market,
             'currency' => $payload->flightEngineQuestionnaireData->currency,
-            'locale' => config('app.locale'),
+            $payload->carry = Uri::withQueryValues($payload->carry, ['market' => $payload->market, 'currency' => $payload->flightEngineQuestionnaireData->currency, 'locale' > config('app.locale')]);
         ]);
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
