[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/Origin.php:19:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->origin);
+        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/');
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Output does not contain "fra/lax".

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:351
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:317
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/testing/PendingCommand.php:481
/Users/ag/Documents/Pr

[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/Origin.php:19:9
     {
         Assert::isInstanceOf($payload, FlightWrapper::class);
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->origin);
+        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . $payload->origin);
 
         return $next($payload);
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
