[Killed] GreaterThanNegotiation
Pipelines/FlightEngines/SkyScanner/Passengers.php:24:9
 
         $queries = [];
 
-        if ($payload->flightEngineQuestionnaireData->adults > 0) {
+        if ($payload->flightEngineQuestionnaireData->adults <= 0) {
             $queries['adults'] = (string) $payload->flightEngineQuestionnaireData->adults;
             $queries['adultsv2'] = (string) $payload->flightEngineQuestionnaireData->adults;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThan
Pipelines/FlightEngines/SkyScanner/Passengers.php:24:9
 
         $queries = [];
 
-        if ($payload->flightEngineQuestionnaireData->adults > 0) {
+        if ($payload->flightEngineQuestionnaireData->adults >= 0) {
             $queries['adults'] = (string) $payload->flightEngineQuestionnaireData->adults;
             $queries['adultsv2'] = (string) $payload->flightEngineQuestionnaireData->adults;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastString
Pipelines/FlightEngines/SkyScanner/Passengers.php:26:13
 
         if ($payload->flightEngineQuestionnaireData->adults > 0) {
             $queries['adults'] = (string) $payload->flightEngineQuestionnaireData->adults;
-            $queries['adultsv2'] = (string) $payload->flightEngineQuestionnaireData->adults;
+            $queries['adultsv2'] = $payload->flightEngineQuestionnaireData->adults;
         }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThan
Pipelines/FlightEngines/SkyScanner/Passengers.php:29:9
             $queries['adultsv2'] = (string) $payload->flightEngineQuestionnaireData->adults;
         }
 
-        if ($payload->flightEngineQuestionnaireData->children > 0) {
+        if ($payload->flightEngineQuestionnaireData->children >= 0) {
             $queries['children'] = (string) $payload->flightEngineQuestionnaireData->children;
             $queries['childrenv2'] = (string) $payload->flightEngineQuestionnaireData->children;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThanNegotiation
Pipelines/FlightEngines/SkyScanner/Passengers.php:29:9
             $queries['adultsv2'] = (string) $payload->flightEngineQuestionnaireData->adults;
         }
 
-        if ($payload->flightEngineQuestionnaireData->children > 0) {
+        if ($payload->flightEngineQuestionnaireData->children <= 0) {
             $queries['children'] = (string) $payload->flightEngineQuestionnaireData->children;
             $queries['childrenv2'] = (string) $payload->flightEngineQuestionnaireData->children;
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThanNegotiation
Pipelines/FlightEngines/SkyScanner/Passengers.php:34:9
             $queries['childrenv2'] = (string) $payload->flightEngineQuestionnaireData->children;
         }
 
-        if ($payload->flightEngineQuestionnaireData->infants > 0) {
+        if ($payload->flightEngineQuestionnaireData->infants <= 0) {
             $queries['infants'] = (string) $payload->flightEngineQuestionnaireData->infants;
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThan
Pipelines/FlightEngines/SkyScanner/Passengers.php:34:9
             $queries['childrenv2'] = (string) $payload->flightEngineQuestionnaireData->children;
         }
 
-        if ($payload->flightEngineQuestionnaireData->infants > 0) {
+        if ($payload->flightEngineQuestionnaireData->infants >= 0) {
             $queries['infants'] = (string) $payload->flightEngineQuestionnaireData->infants;
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] CastString
Pipelines/FlightEngines/SkyScanner/Passengers.php:35:13
         }
 
         if ($payload->flightEngineQuestionnaireData->infants > 0) {
-            $queries['infants'] = (string) $payload->flightEngineQuestionnaireData->infants;
+            $queries['infants'] = $payload->flightEngineQuestionnaireData->infants;
         }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
