[Killed] ConcatOperandRemoval
Pipelines/FlightEngines/SkyScanner/ReturnDate.php:23:9
             return $next($payload);
         }
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->dateB->format('ymd'));
+        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . $payload->dates->dateB->format('ymd'));
         return $next($payload);
     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] Concat
Pipelines/FlightEngines/SkyScanner/ReturnDate.php:23:9
             return $next($payload);
         }
 
-        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . '/' . $payload->dates->dateB->format('ymd'));
+        $payload->carry = $payload->carry->withPath($payload->carry->getPath() . $payload->dates->dateB->format('ymd') . '/');
         return $next($payload);
     }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.
