[Killed] GreaterThanOrEqualTo
Pipelines/FlightEngines/SkyScanner/Stopovers.php:22:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        if ($payload->flightEngineQuestionnaireData->maxStops >= 2) {
+        if ($payload->flightEngineQuestionnaireData->maxStops > 2) {
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] GreaterThanOrEqualToNegotiation
Pipelines/FlightEngines/SkyScanner/Stopovers.php:22:9
         Assert::isInstanceOf($payload, FlightWrapper::class);
         Assert::isInstanceOf($payload->flightEngineQuestionnaireData, SkyScannerQuestionnaireData::class);
 
-        if ($payload->flightEngineQuestionnaireData->maxStops >= 2) {
+        if ($payload->flightEngineQuestionnaireData->maxStops < 2) {
             return $next($payload);
         }
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] MatchArmRemoval
Pipelines/FlightEngines/SkyScanner/Stopovers.php:26:9
             return $next($payload);
         }
 
-        $stops = match ($payload->flightEngineQuestionnaireData->maxStops) {
-            0 => '!oneStop,!twoPlusStops',
-            1 => '!twoPlusStops',
-            default => throw new InvalidArgumentException('Invalid number of stops'),
-        };
+        
 
         $payload->carry = Uri::withQueryValues($payload->carry, [
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] DecrementInteger
Pipelines/FlightEngines/SkyScanner/Stopovers.php:27:13
         }
 
         $stops = match ($payload->flightEngineQuestionnaireData->maxStops) {
-            0 => '!oneStop,!twoPlusStops',
+            -1 => '!oneStop,!twoPlusStops',
             1 => '!twoPlusStops',
             default => throw new InvalidArgumentException('Invalid number of stops'),
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] IncrementInteger
Pipelines/FlightEngines/SkyScanner/Stopovers.php:27:13
         }
 
         $stops = match ($payload->flightEngineQuestionnaireData->maxStops) {
-            0 => '!oneStop,!twoPlusStops',
+            1 => '!oneStop,!twoPlusStops',
             1 => '!twoPlusStops',
             default => throw new InvalidArgumentException('Invalid number of stops'),
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Failed asserting that 32 matches expected 33.

/Users/ag/Documents/Projects/link-generator/tests/Feature/Flights/SkyScannerTest.php:67

FAILURES!
Tests: 1, Assertions: 37, Failures: 1.

[Killed] DecrementInteger
Pipelines/FlightEngines/SkyScanner/Stopovers.php:28:13
 
         $stops = match ($payload->flightEngineQuestionnaireData->maxStops) {
             0 => '!oneStop,!twoPlusStops',
-            1 => '!twoPlusStops',
+            0 => '!twoPlusStops',
             default => throw new InvalidArgumentException('Invalid number of stops'),
         };
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
InvalidArgumentException: Invalid number of stops

/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/Stopovers.php:26
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/pipeline/Pipeline.php:181
/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/Passengers.php:

[Killed] IncrementInteger
Pipelines/FlightEngines/SkyScanner/Stopovers.php:28:13
 
         $stops = match ($payload->flightEngineQuestionnaireData->maxStops) {
             0 => '!oneStop,!twoPlusStops',
-            1 => '!twoPlusStops',
+            2 => '!twoPlusStops',
             default => throw new InvalidArgumentException('Invalid number of stops'),
         };
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
InvalidArgumentException: Invalid number of stops

/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/Stopovers.php:26
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/pipeline/Pipeline.php:181
/Users/ag/Documents/Projects/link-generator/app/Pipelines/FlightEngines/SkyScanner/Passengers.php:
