[Killed] MethodCallRemoval
Providers/AppServiceProvider.php:18:9
      */
     public function boot()
     {
-        $this->app->tag([
-            SkyScannerQuestionnaire::class,
-        ], 'flight-engine-questionnaires');
+        
 
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Illuminate\Support\ItemNotFoundException: 

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/collections/Collection.php:1238
/Users/ag/Documents/Projects/link-generator/app/Commands/FlightLinksCommand.php:120
/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/BoundMethod.php:36
/Users/ag/Documents/Proj

[Killed] MethodCallRemoval
Providers/AppServiceProvider.php:23:9
         ], 'flight-engine-questionnaires');
 
 
-        $this->app->when(FlightLinksCommand::class)
-            ->needs('$flightEngineQuestionnaires')
-            ->giveTagged('flight-engine-questionnaires');
+        
     }
 
killedBy: Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
statusReason: 1) Tests\Feature\Flights\SkyScannerTest::happy_path_skyscanner
Illuminate\Contracts\Container\BindingResolutionException: Unresolvable dependency resolving [Parameter #0 [ <required> array $flightEngineQuestionnaires ]] in class App\Commands\FlightLinksCommand

/Users/ag/Documents/Projects/link-generator/vendor/illuminate/container/Container.php:1106
/Users/ag/Documents/Projects/link-generator/ven
